MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_dcu.c
/*******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file hc32f46x_dcu.c
 **
 ** A detailed description is available at
 ** @link DcuGroup DCU description @endlink
 **
 **   - 2018-10-15  1.0 Hongjh First version for Device Driver Library of DCU.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f46x_dcu.h"
#include "hc32f46x_utility.h"

#if (DDL_DCU_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup DcuGroup
 ******************************************************************************/

//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*!< Parameter valid check for DCU Instances. */
#define IS_VALID_DCU(__DCUx__)  \
    ((M4_DCU1 == (__DCUx__)) || \
     (M4_DCU2 == (__DCUx__)) || \
     (M4_DCU3 == (__DCUx__)) || \
     (M4_DCU4 == (__DCUx__)))

/*!< Parameter valid check for DCU DATA register. */
#define IS_VALID_DCU_DATA_REG(x)  \
    ((DcuRegisterData0 == (x)) || \
     (DcuRegisterData1 == (x)) || \
     (DcuRegisterData2 == (x)))

/*!< Parameter valid check for DCU operation mode. */
#define IS_VALID_DCU_OPERATION(x) \
    ((DcuOpAdd == (x)) ||         \
     (DcuOpSub == (x)) ||         \
     (DcuInvalid == (x)) ||       \
     (DcuOpCompare == (x)) ||     \
     (DcuHwTrigOpAdd == (x)) ||   \
     (DcuHwTrigOpSub == (x)))

/*!< Parameter valid check for DCU data size. */
#define IS_VALID_DCU_DATAZ_SIZE(x) \
    ((DcuDataBit8 == (x)) ||       \
     (DcuDataBit16 == (x)) ||      \
     (DcuDataBit32 == (x)))

/*!< Parameter valid check for DCU compare trigger mode type. */
#define IS_VALID_DCU_CMP_TRIG_MODE(x) \
    ((DcuCmpTrigbyData0 == (x)) ||    \
     (DcuCmpTrigbyData012 == (x)))

/*!< Parameter valid check for DCU interrupt. */
#define IS_VALID_DCU_INT(x) \
    ((DcuIntOp == (x)) ||   \
     (DcuIntLs2 == (x)) ||  \
     (DcuIntEq2 == (x)) ||  \
     (DcuIntGt2 == (x)) ||  \
     (DcuIntLs1 == (x)) ||  \
     (DcuIntEq1 == (x)) ||  \
     (DcuIntGt1 == (x)))

/*!< Parameter valid check for DCU interrupt mode. */
#define IS_VALID_DCU_INT_WIN_MODE(x) \
    ((DcuIntInvalid == (x)) ||       \
     (DcuWinIntInvalid == (x)) ||    \
     (DcuInsideWinCmpInt == (x)) ||  \
     (DcuOutsideWinCmpInt == (x)))

/*!< Parameter valid check for external trigger event. */
#define IS_VALID_TRG_SRC_EVENT(x)                                  \
    ((((x) >= EVT_PORT_EIRQ0) && ((x) <= EVT_PORT_EIRQ15)) ||      \
     (((x) >= EVT_DMA1_TC0) && ((x) <= EVT_DMA2_BTC3)) ||          \
     (((x) >= EVT_EFM_OPTEND) && ((x) <= EVT_USBFS_SOF)) ||        \
     (((x) >= EVT_DCU1) && ((x) <= EVT_DCU4)) ||                   \
     (((x) >= EVT_TMR01_GCMA) && ((x) <= EVT_TMR02_GCMB)) ||       \
     (((x) >= EVT_RTC_ALM) && ((x) <= EVT_RTC_PRD)) ||             \
     (((x) >= EVT_TMR61_GCMA) && ((x) <= EVT_TMR61_GUDF)) ||       \
     (((x) >= EVT_TMR61_SCMA) && ((x) <= EVT_TMR61_SCMB)) ||       \
     (((x) >= EVT_TMR62_GCMA) && ((x) <= EVT_TMR62_GUDF)) ||       \
     (((x) >= EVT_TMR62_SCMA) && ((x) <= EVT_TMR62_SCMB)) ||       \
     (((x) >= EVT_TMR63_GCMA) && ((x) <= EVT_TMR63_GUDF)) ||       \
     (((x) >= EVT_TMR63_SCMA) && ((x) <= EVT_TMR63_SCMB)) ||       \
     (((x) >= EVT_TMRA1_OVF) && ((x) <= EVT_TMRA5_CMP)) ||         \
     (((x) >= EVT_TMRA6_OVF) && ((x) <= EVT_TMRA6_CMP)) ||         \
     (((x) >= EVT_USART1_EI) && ((x) <= EVT_USART4_RTO)) ||        \
     (((x) >= EVT_SPI1_SRRI) && ((x) <= EVT_AOS_STRG)) ||          \
     (((x) >= EVT_TMR41_SCMUH) && ((x) <= EVT_TMR42_SCMWL)) ||     \
     (((x) >= EVT_TMR43_SCMUH) && ((x) <= EVT_TMR43_SCMWL)) ||     \
     (((x) >= EVT_EVENT_PORT1) && ((x) <= EVT_EVENT_PORT4)) ||     \
     (((x) >= EVT_I2S1_TXIRQOUT) && ((x) <= EVT_I2S1_RXIRQOUT)) || \
     (((x) >= EVT_I2S2_TXIRQOUT) && ((x) <= EVT_I2S2_RXIRQOUT)) || \
     (((x) >= EVT_I2S3_TXIRQOUT) && ((x) <= EVT_I2S3_RXIRQOUT)) || \
     (((x) >= EVT_I2S4_TXIRQOUT) && ((x) <= EVT_I2S4_RXIRQOUT)) || \
     (((x) >= EVT_ACMP1) && ((x) <= EVT_ACMP3)) ||                 \
     (((x) >= EVT_I2C1_RXI) && ((x) <= EVT_I2C3_EE1)) ||           \
     (((x) >= EVT_PVD_PVD1) && ((x) <= EVT_OTS)) ||                \
     ((x) == EVT_WDT_REFUDF) ||                                    \
     (((x) >= EVT_ADC1_EOCA) && ((x) <= EVT_TRNG_END)) ||          \
     (((x) >= EVT_SDIOC1_DMAR) && ((x) <= EVT_SDIOC1_DMAW)) ||     \
     (((x) >= EVT_SDIOC2_DMAR) && ((x) <= EVT_SDIOC2_DMAW)) ||     \
     ((x) == EVT_MAX))

/*!< Get the specified DATA register address of the specified DCU unit */
#define DCU_DATAx(__DCUx__, __DATAx__) ((uint32_t)(&(__DCUx__)->DATA0) + ((uint32_t)(__DATAx__)) * 4u)

