MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_dcu.c
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
static __IO uint32_t *DCU_TRGSELx(const M4_DCU_TypeDef *DCUx);

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 *******************************************************************************
 ** \brief Initializes a DCU.
 **
 ** \param [in] DCUx                    Pointer to DCU instance register base
 ** \arg M4_DCU1                        DCU unit 1 instance register base
 ** \arg M4_DCU2                        DCU unit 2 instance register base
 ** \arg M4_DCU3                        DCU unit 3 instance register base
 ** \arg M4_DCU4                        DCU unit 4 instance register base
 ** \param [in] pstcInitCfg             Pointer to DCU configure structure
 ** \arg This parameter detail refer @ref stc_dcu_init_t
 **
 ** \retval Ok                          DCU is initialized normally
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - DCUx is invalid
 **                                     - pstcInitCfg == NULL
 **                                     - Other invalid configuration
 **
 ******************************************************************************/
en_result_t DCU_Init(M4_DCU_TypeDef *DCUx, const stc_dcu_init_t *pstcInitCfg)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check for DCUx && pstcInitCfg pointer */
    if ((IS_VALID_DCU(DCUx)) && (NULL != pstcInitCfg))
    {
        /* Check the parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->enIntCmd));
        DDL_ASSERT(IS_VALID_DCU_OPERATION(pstcInitCfg->enOperation));
        DDL_ASSERT(IS_VALID_DCU_DATAZ_SIZE(pstcInitCfg->enDataSize));
        DDL_ASSERT(IS_VALID_DCU_INT_WIN_MODE(pstcInitCfg->enIntWinMode));
        DDL_ASSERT(IS_VALID_DCU_CMP_TRIG_MODE(pstcInitCfg->enCmpTriggerMode));

        /* De-initialize dcu register value */
        DCUx->CTL = 0ul;
        DCUx->INTSEL = 0ul;
        DCUx->FLAGCLR = 0x7Ful;

        /* Set dcu operation mode */
        DCUx->CTL_f.MODE = (uint32_t)pstcInitCfg->enOperation;

        /* Set dcu data sieze */
        DCUx->CTL_f.DATASIZE = (uint32_t)pstcInitCfg->enDataSize;

        /* Set dcu compare trigger mode */
        DCUx->CTL_f.COMP_TRG = (uint32_t)pstcInitCfg->enCmpTriggerMode;

        /* Set dcu interrupt window mode */
        DCUx->INTSEL_f.INT_WIN = (uint32_t)pstcInitCfg->enIntWinMode;

        DCUx->INTSEL = pstcInitCfg->u32IntSel;
        DCUx->CTL_f.INTEN = (uint32_t)(pstcInitCfg->enIntCmd);

        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief De-Initializes a DCU.
 **
 ** \param [in] DCUx                    Pointer to DCU instance register base
 ** \arg M4_DCU1                        DCU unit 1 instance register base
 ** \arg M4_DCU2                        DCU unit 2 instance register base
 ** \arg M4_DCU3                        DCU unit 3 instance register base
 ** \arg M4_DCU4                        DCU unit 4 instance register base
 **
 ** \retval Ok                          De-Initialized successfully.
 ** \retval ErrorInvalidParameter       DCUx is invalid
 **
 ******************************************************************************/
en_result_t DCU_DeInit(M4_DCU_TypeDef *DCUx)
{
    en_result_t enRet = ErrorInvalidParameter;
    __IO uint32_t *TRGSELx = DCU_TRGSELx(DCUx);

    /* Check for DCUx pointer */
    if (IS_VALID_DCU(DCUx))
    {
        /* De-initialize dcu register value */
        DCUx->CTL = 0u;
        DCUx->INTSEL = 0u;
        DCUx->FLAGCLR = 0x7Fu;
        *TRGSELx = EVT_MAX;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set DCU operation mode.
 **
 ** \param [in] DCUx                    Pointer to DCU instance register base
 ** \arg M4_DCU1                        DCU unit 1 instance register base
 ** \arg M4_DCU2                        DCU unit 2 instance register base
 ** \arg M4_DCU3                        DCU unit 3 instance register base
 ** \arg M4_DCU4                        DCU unit 4 instance register base
 ** \param [in] enMode                  DCU operation mode
 ** \arg DcuInvalid                     Invalid
 ** \arg DcuOpAdd                       Operation: Add
 ** \arg DcuOpSub                       Operation: Sub
 ** \arg DcuHwTrigOpAdd                 Operation: Hardware trigger Add
 ** \arg DcuHwTrigOpSub                 Operation: Hardware trigger Sub
 ** \arg DcuOpCompare                   Operation: Compare
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       DCUx is invalid
 **
 ******************************************************************************/
en_result_t DCU_SetOperationMode(M4_DCU_TypeDef *DCUx,
                                 en_dcu_operation_mode_t enMode)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check for DCUx pointer */
    if (IS_VALID_DCU(DCUx))
    {
        /* Check the parameters */
        DDL_ASSERT(IS_VALID_DCU_OPERATION(enMode));

        DCUx->CTL_f.MODE = (uint32_t)enMode;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get DCU operation mode.
 **
 ** \param [in] DCUx                    Pointer to DCU instance register base
 ** \arg M4_DCU1                        DCU unit 1 instance register base
 ** \arg M4_DCU2                        DCU unit 2 instance register base
 ** \arg M4_DCU3                        DCU unit 3 instance register base
 ** \arg M4_DCU4                        DCU unit 4 instance register base
 **
 ** \retval DcuInvalid                  Invalid
 ** \retval DcuOpAdd                    Operation: Add
 ** \retval DcuOpSub                    Operation: Sub
 ** \retval DcuHwTrigOpAdd              Operation: Hardware trigger Add
 ** \retval DcuHwTrigOpSub              Operation: Hardware trigger Sub
 ** \retval DcuOpCompare                Operation: Compare
 **
 ******************************************************************************/
en_dcu_operation_mode_t DCU_GetOperationMode(M4_DCU_TypeDef *DCUx)
{
    /* Check for DCUx pointer */
    DDL_ASSERT(IS_VALID_DCU(DCUx));

    return (en_dcu_operation_mode_t)DCUx->CTL_f.MODE;
}

/**
 *******************************************************************************
 ** \brief Set DCU data size.
 **
 ** \param [in] DCUx                    Pointer to DCU instance register base
 ** \arg M4_DCU1                        DCU unit 1 instance register base
 ** \arg M4_DCU2                        DCU unit 2 instance register base
 ** \arg M4_DCU3                        DCU unit 3 instance register base
 ** \arg M4_DCU4                        DCU unit 4 instance register base
 ** \param [in] enSize                  DCU data size
 ** \arg DcuDataBit8                    8 bit
 ** \arg DcuDataBit16                   16 bit
 ** \arg DcuDataBit32                   32 bit
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       DCUx is invalid
 **
 ******************************************************************************/
en_result_t DCU_SetDataSize(M4_DCU_TypeDef *DCUx, en_dcu_data_size_t enSize)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check for DCUx pointer */
    if (IS_VALID_DCU(DCUx))
    {
        /* Check the parameters */
        DDL_ASSERT(IS_VALID_DCU_DATAZ_SIZE(enSize));

