MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_dcu.c
        DCUx->CTL_f.DATASIZE = (uint32_t)enSize;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get DCU data size.
 **
 ** \param [in] DCUx                    Pointer to DCU instance register base
 ** \arg M4_DCU1                        DCU unit 1 instance register base
 ** \arg M4_DCU2                        DCU unit 2 instance register base
 ** \arg M4_DCU3                        DCU unit 3 instance register base
 ** \arg M4_DCU4                        DCU unit 4 instance register base
 **
 ** \retval DcuDataBit8                 8 bit
 ** \retval DcuDataBit16                16 bit
 ** \retval DcuDataBit32                32 bit
 **
 ******************************************************************************/
en_dcu_data_size_t DCU_GetDataSize(M4_DCU_TypeDef *DCUx)
{
    /* Check for DCUx pointer */
    DDL_ASSERT(IS_VALID_DCU(DCUx));

    return (en_dcu_data_size_t)(DCUx->CTL_f.DATASIZE);
}

/**
 *******************************************************************************
 ** \brief Set DCU interrup window.
 **
 ** \param [in] DCUx                    Pointer to DCU instance register base
 ** \arg M4_DCU1                        DCU unit 1 instance register base
 ** \arg M4_DCU2                        DCU unit 2 instance register base
 ** \arg M4_DCU3                        DCU unit 3 instance register base
 ** \arg M4_DCU4                        DCU unit 4 instance register base
 ** \param [in] enIntWinMode            Interrupt window mode
 ** \arg DcuIntInvalid                  DCU don't occur interrupt
 ** \arg DcuWinIntInvalid               DCU window interrupt is invalid.
 ** \arg DcuInsideWinCmpInt             DCU occur interrupt when DATA2 �� DATA0 �� DATA2
 ** \arg DcuOutsideWinCmpInt            DCU occur interrupt when DATA0 > DATA1 or DATA0 < DATA2
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       DCUx is invalid
 **
 ******************************************************************************/
en_result_t DCU_SetIntWinMode(M4_DCU_TypeDef *DCUx,
                              en_dcu_int_win_mode_t enIntWinMode)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check the parameters */
    DDL_ASSERT(IS_VALID_DCU_INT_WIN_MODE(enIntWinMode));

    /* Check for DCUx pointer */
    if (IS_VALID_DCU(DCUx))
    {
        DCUx->INTSEL_f.INT_WIN = (uint32_t)enIntWinMode;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get DCU interrup window.
 **
 ** \param [in] DCUx                    Pointer to DCU instance register base
 ** \arg M4_DCU1                        DCU unit 1 instance register base
 ** \arg M4_DCU2                        DCU unit 2 instance register base
 ** \arg M4_DCU3                        DCU unit 3 instance register base
 ** \arg M4_DCU4                        DCU unit 4 instance register base
 **
 ** \retval DcuIntInvalid               DCU don't occur interrupt
 ** \retval DcuWinIntInvalid            DCU window interrupt is invalid.
 ** \retval DcuInsideWinCmpInt          DCU occur interrupt when DATA2 �� DATA0 �� DATA2
 ** \retval DcuOutsideWinCmpInt         DCU occur interrupt when DATA0 > DATA1 or DATA0 < DATA2
 **
 ******************************************************************************/
en_dcu_int_win_mode_t DCU_GetIntWinMode(M4_DCU_TypeDef *DCUx)
{
    /* Check for DCUx pointer */
    DDL_ASSERT(IS_VALID_DCU(DCUx));

    return (en_dcu_int_win_mode_t)(DCUx->INTSEL_f.INT_WIN);
}

/**
 *******************************************************************************
 ** \brief Set DCU compare trigger mode.
 **
 ** \param [in] DCUx                    Pointer to DCU instance register base
 ** \arg M4_DCU1                        DCU unit 1 instance register base
 ** \arg M4_DCU2                        DCU unit 2 instance register base
 ** \arg M4_DCU3                        DCU unit 3 instance register base
 ** \arg M4_DCU4                        DCU unit 4 instance register base
 ** \param [in] enTriggerMode           DCU compare trigger mode
 ** \arg DcuCmpTrigbyData0              DCU compare triggered by DATA0
 ** \arg DcuCmpTrigbyData012            DCU compare triggered by DATA0 or DATA1 or DATA2
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       DCUx is invalid
 **
 ******************************************************************************/
en_result_t DCU_SetCmpTriggerMode(M4_DCU_TypeDef *DCUx,
                                  en_dcu_cmp_trigger_mode_t enTriggerMode)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check for DCUx pointer */
    if (IS_VALID_DCU(DCUx))
    {
        /* Check the parameters */
        DDL_ASSERT(IS_VALID_DCU_CMP_TRIG_MODE(enTriggerMode));

        DCUx->CTL_f.COMP_TRG = (uint32_t)enTriggerMode;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get DCU compare trigger mode.
 **
 ** \param [in] DCUx                    Pointer to DCU instance register base
 ** \arg M4_DCU1                        DCU unit 1 instance register base
 ** \arg M4_DCU2                        DCU unit 2 instance register base
 ** \arg M4_DCU3                        DCU unit 3 instance register base
 ** \arg M4_DCU4                        DCU unit 4 instance register base
 **
 ** \retval DcuCmpTrigbyData0           DCU compare triggered by DATA0
 ** \retval DcuCmpTrigbyData012         DCU compare triggered by DATA0 or DATA1 or DATA2
 **
 ******************************************************************************/
en_dcu_cmp_trigger_mode_t DCU_GetCmpTriggerMode(M4_DCU_TypeDef *DCUx)
{
    /* Check for DCUx pointer */
    DDL_ASSERT(IS_VALID_DCU(DCUx));

    return (en_dcu_cmp_trigger_mode_t)(DCUx->CTL_f.COMP_TRG);
}

/**
 *******************************************************************************
 ** \brief Enable DCU interrupt.
 **
 ** \param [in] DCUx                    Pointer to DCU instance register base
 ** \arg M4_DCU1                        DCU unit 1 instance register base
 ** \arg M4_DCU2                        DCU unit 2 instance register base
 ** \arg M4_DCU3                        DCU unit 3 instance register base
 ** \arg M4_DCU4                        DCU unit 4 instance register base
 ** \param [in] enCmd                   DCU interrupt state
 ** \arg Enable                         Enable the DCU interrupt function
 ** \arg Disable                        Disable the DCU interrupt function
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       DCUx is invalid
 **
 ******************************************************************************/
en_result_t DCU_IrqCmd(M4_DCU_TypeDef *DCUx, en_functional_state_t enCmd)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check for DCUx pointer */
    if (IS_VALID_DCU(DCUx))
    {
        /* Check the parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enCmd));

