MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_dcu.c
        DCUx->CTL_f.INTEN = (uint32_t)(enCmd);
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get the specified DCU flag
 **
 ** \param [in] DCUx                    Pointer to DCU instance register base
 ** \arg M4_DCU1                        DCU unit 1 instance register base
 ** \arg M4_DCU2                        DCU unit 2 instance register base
 ** \arg M4_DCU3                        DCU unit 3 instance register base
 ** \arg M4_DCU4                        DCU unit 4 instance register base
 ** \param [in] enFlag                  The specified DCU flag
 ** \arg DcuIntOp                       DCU overflow or underflow
 ** \arg DcuIntLs2                      DCU DATA0 < DATA2
 ** \arg DcuIntEq2                      DCU DATA0 = DATA2
 ** \arg DcuIntGt2                      DCU DATA0 > DATA2
 ** \arg DcuIntLs1                      DCU DATA0 < DATA1
 ** \arg DcuIntEq1                      DCU DATA0 = DATA1
 ** \arg DcuIntGt1                      DCU DATA0 > DATA1
 **
 ** \retval Set                         Flag is set.
 ** \retval Reset                       Flag is reset or enStatus is invalid.
 **
 ******************************************************************************/
en_flag_status_t DCU_GetIrqFlag(M4_DCU_TypeDef *DCUx, en_dcu_flag_t enFlag)
{
    /* Check the parameters */
    DDL_ASSERT(IS_VALID_DCU(DCUx));
    DDL_ASSERT(IS_VALID_DCU_INT(enFlag));

    return ((DCUx->FLAG & enFlag) ? Set : Reset);
}

/**
 *******************************************************************************
 ** \brief Clear the specified DCU flag
 **
 ** \param [in] DCUx                    Pointer to DCU instance register base
 ** \arg M4_DCU1                        DCU unit 1 instance register base
 ** \arg M4_DCU2                        DCU unit 2 instance register base
 ** \arg M4_DCU3                        DCU unit 3 instance register base
 ** \arg M4_DCU4                        DCU unit 4 instance register base
 ** \param [in] enFlag                  the specified DCU flag
 ** \arg DcuIntOp                       DCU overflow or underflow
 ** \arg DcuIntLs2                      DCU DATA0 < DATA2
 ** \arg DcuIntEq2                      DCU DATA0 = DATA2
 ** \arg DcuIntGt2                      DCU DATA0 > DATA2
 ** \arg DcuIntLs1                      DCU DATA0 < DATA1
 ** \arg DcuIntEq1                      DCU DATA0 = DATA1
 ** \arg DcuIntGt1                      DCU DATA0 > DATA1
 **
 ** \retval Ok                          Clear flag successfully.
 ** \retval ErrorInvalidParameter       DCUx is invalid
 **
 ******************************************************************************/
en_result_t DCU_ClearIrqFlag(M4_DCU_TypeDef *DCUx, en_dcu_flag_t enFlag)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check for DCUx pointer */
    if (IS_VALID_DCU(DCUx))
    {
        /* Check the parameters */
        DDL_ASSERT(IS_VALID_DCU_INT(enFlag));
        DCUx->FLAGCLR = (uint32_t)enFlag;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Enable/Disable DCU interrupt.
 **
 ** \param [in] DCUx                    Pointer to DCU instance register base
 ** \arg M4_DCU1                        DCU unit 1 instance register base
 ** \arg M4_DCU2                        DCU unit 2 instance register base
 ** \arg M4_DCU3                        DCU unit 3 instance register base
 ** \arg M4_DCU4                        DCU unit 4 instance register base
 ** \param [in] enIntSel                DCU interrupt selection
 ** \arg DcuIntOp                       DCU overflow or underflow
 ** \arg DcuIntLs2                      DCU DATA0 < DATA2
 ** \arg DcuIntEq2                      DCU DATA0 = DATA2
 ** \arg DcuIntGt2                      DCU DATA0 > DATA2
 ** \arg DcuIntLs1                      DCU DATA0 < DATA1
 ** \arg DcuIntEq1                      DCU DATA0 = DATA1
 ** \arg DcuIntGt1                      DCU DATA0 > DATA1
 ** \param [in] enCmd                   DCU interrupt functional state
 ** \arg Enable                         Enable the specified DCU interrupt function
 ** \arg Disable                        Disable the specified DCU interrupt function
 **
 ** \retval Ok                          Configure successfully.
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - DCUx is invalid
 **                                     - enIntSel is invalid
 **
 ******************************************************************************/
en_result_t DCU_IrqSelCmd(M4_DCU_TypeDef *DCUx,
                          en_dcu_int_sel_t enIntSel,
                          en_functional_state_t enCmd)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check for DCUx pointer */
    if (IS_VALID_DCU(DCUx))
    {
        /* Check the parameters */
        DDL_ASSERT(IS_VALID_DCU_INT(enIntSel));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enCmd));

        enRet = Ok;
        switch (enIntSel)
        {
        case DcuIntOp:
            DCUx->INTSEL_f.INT_OP = (uint32_t)enCmd;
            break;
        case DcuIntLs2:
            DCUx->INTSEL_f.INT_LS2 = (uint32_t)enCmd;
            break;
        case DcuIntEq2:
            DCUx->INTSEL_f.INT_EQ2 = (uint32_t)enCmd;
            break;
        case DcuIntGt2:
            DCUx->INTSEL_f.INT_GT2 = (uint32_t)enCmd;
            break;
        case DcuIntLs1:
            DCUx->INTSEL_f.INT_LS1 = (uint32_t)enCmd;
            break;
        case DcuIntEq1:
            DCUx->INTSEL_f.INT_EQ1 = (uint32_t)enCmd;
            break;
        case DcuIntGt1:
            DCUx->INTSEL_f.INT_GT1 = (uint32_t)enCmd;
            break;
        default:
            enRet = ErrorInvalidParameter;
            break;
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Read DCU register DATAx
 **
 ** \param [in] DCUx                    Pointer to DCU instance register base
 ** \arg M4_DCU1                        DCU unit 1 instance register base
 ** \arg M4_DCU2                        DCU unit 2 instance register base
 ** \arg M4_DCU3                        DCU unit 3 instance register base
 ** \arg M4_DCU4                        DCU unit 4 instance register base
 ** \param [in] enDataReg               The specified DATA register.
 ** \arg DcuRegisterData0               DCU register DATA0
 ** \arg DcuRegisterData1               DCU register DATA1
 ** \arg DcuRegisterData2               DCU register DATA2
 **
 ** \retval DCU register DATAx value
 **
 ******************************************************************************/
uint8_t DCU_ReadDataByte(M4_DCU_TypeDef *DCUx,
                         en_dcu_data_register_t enDataReg)
{
    /* Check the parameters */
    DDL_ASSERT(IS_VALID_DCU(DCUx));
    DDL_ASSERT(IS_VALID_DCU_DATA_REG(enDataReg));

    return *(uint8_t *)DCU_DATAx(DCUx, enDataReg);
}

/**
 *******************************************************************************
 ** \brief Write DCU register DATAx
 **
 ** \param [in] DCUx                    Pointer to DCU instance register base
 ** \arg M4_DCU1                        DCU unit 1 instance register base
 ** \arg M4_DCU2                        DCU unit 2 instance register base
 ** \arg M4_DCU3                        DCU unit 3 instance register base
 ** \arg M4_DCU4                        DCU unit 4 instance register base
 ** \param [in] enDataReg               The specified DATA register.
 ** \arg DcuRegisterData0               DCU register DATA0
 ** \arg DcuRegisterData1               DCU register DATA1
 ** \arg DcuRegisterData2               DCU register DATA2
 ** \param [in] u8Data                  The data will be written.
 **
 ** \retval Ok                          Write successfully.
 ** \retval ErrorInvalidParameter       DCUx is invalid
 **
 ******************************************************************************/
en_result_t DCU_WriteDataByte(M4_DCU_TypeDef *DCUx,
                              en_dcu_data_register_t enDataReg,
                              uint8_t u8Data)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check for DCUx pointer */
    if (IS_VALID_DCU(DCUx))
    {
        /* Check the parameters */
        DDL_ASSERT(IS_VALID_DCU_DATA_REG(enDataReg));

