MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_dcu.c
        *(uint8_t *)DCU_DATAx(DCUx, enDataReg) = u8Data;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Read DCU register DATAx
 **
 ** \param [in] DCUx                    Pointer to DCU instance register base
 ** \arg M4_DCU1                        DCU unit 1 instance register base
 ** \arg M4_DCU2                        DCU unit 2 instance register base
 ** \arg M4_DCU3                        DCU unit 3 instance register base
 ** \arg M4_DCU4                        DCU unit 4 instance register base
 ** \param [in] enDataReg               The specified DATA register.
 ** \arg DcuRegisterData0               DCU register DATA0
 ** \arg DcuRegisterData1               DCU register DATA1
 ** \arg DcuRegisterData2               DCU register DATA2
 **
 ** \retval DCU register DATAx value
 **
 ******************************************************************************/
uint16_t DCU_ReadDataHalfWord(M4_DCU_TypeDef *DCUx,
                              en_dcu_data_register_t enDataReg)
{
    /* Check the parameters */
    DDL_ASSERT(IS_VALID_DCU(DCUx));
    DDL_ASSERT(IS_VALID_DCU_DATA_REG(enDataReg));

    return *(uint16_t *)DCU_DATAx(DCUx, enDataReg);
}

/**
 *******************************************************************************
 ** \brief Write DCU register DATAx
 **
 ** \param [in] DCUx                    Pointer to DCU instance register base
 ** \arg M4_DCU1                        DCU unit 1 instance register base
 ** \arg M4_DCU2                        DCU unit 2 instance register base
 ** \arg M4_DCU3                        DCU unit 3 instance register base
 ** \arg M4_DCU4                        DCU unit 4 instance register base
 ** \param [in] enDataReg               The specified DATA register.
 ** \arg DcuRegisterData0               DCU register DATA0
 ** \arg DcuRegisterData1               DCU register DATA1
 ** \arg DcuRegisterData2               DCU register DATA2
 ** \param [in] u16Data                 The data will be written.
 **
 ** \retval Ok                          Write successfully.
 ** \retval ErrorInvalidParameter       DCUx is invalid
 **
 ******************************************************************************/
en_result_t DCU_WriteDataHalfWord(M4_DCU_TypeDef *DCUx,
                                  en_dcu_data_register_t enDataReg,
                                  uint16_t u16Data)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check for DCUx pointer */
    if (IS_VALID_DCU(DCUx))
    {
        /* Check the parameters */
        DDL_ASSERT(IS_VALID_DCU_DATA_REG(enDataReg));

        *(uint16_t *)DCU_DATAx(DCUx, enDataReg) = u16Data;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Read DCU register DATAx
 **
 ** \param [in] DCUx                    Pointer to DCU instance register base
 ** \arg M4_DCU1                        DCU unit 1 instance register base
 ** \arg M4_DCU2                        DCU unit 2 instance register base
 ** \arg M4_DCU3                        DCU unit 3 instance register base
 ** \arg M4_DCU4                        DCU unit 4 instance register base
 ** \param [in] enDataReg               The specified DATA register.
 ** \arg DcuRegisterData0               DCU register DATA0
 ** \arg DcuRegisterData1               DCU register DATA1
 ** \arg DcuRegisterData2               DCU register DATA2
 **
 ** \retval DCU register DATAx value
 **
 ******************************************************************************/
uint32_t DCU_ReadDataWord(M4_DCU_TypeDef *DCUx,
                          en_dcu_data_register_t enDataReg)
{
    /* Check the parameters */
    DDL_ASSERT(IS_VALID_DCU(DCUx));
    DDL_ASSERT(IS_VALID_DCU_DATA_REG(enDataReg));

    return *(uint32_t *)DCU_DATAx(DCUx, enDataReg);
}

/**
 *******************************************************************************
 ** \brief Write DCU register DATAx
 **
 ** \param [in] DCUx                    Pointer to DCU instance register base
 ** \arg M4_DCU1                        DCU unit 1 instance register base
 ** \arg M4_DCU2                        DCU unit 2 instance register base
 ** \arg M4_DCU3                        DCU unit 3 instance register base
 ** \arg M4_DCU4                        DCU unit 4 instance register base
 ** \param [in] enDataReg               The specified DATA register.
 ** \arg DcuRegisterData0               DCU register DATA0
 ** \arg DcuRegisterData1               DCU register DATA1
 ** \arg DcuRegisterData2               DCU register DATA2
 ** \param [in] u32Data                 The data will be written.
 **
 ** \retval Ok                          Write successfully.
 ** \retval ErrorInvalidParameter       DCUx is invalid
 **
 ******************************************************************************/
en_result_t DCU_WriteDataWord(M4_DCU_TypeDef *DCUx,
                              en_dcu_data_register_t enDataReg,
                              uint32_t u32Data)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check for DCUx pointer */
    if (IS_VALID_DCU(DCUx))
    {
        /* Check the parameters */
        DDL_ASSERT(IS_VALID_DCU_DATA_REG(enDataReg));

        *(uint32_t *)DCU_DATAx(DCUx, enDataReg) = u32Data;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set DCU trigger source number
 **
 ** \param [in] DCUx                    Pointer to DCU instance register base
 ** \arg M4_DCU1                        DCU unit 1 instance register base
 ** \arg M4_DCU2                        DCU unit 2 instance register base
 ** \arg M4_DCU3                        DCU unit 3 instance register base
 ** \arg M4_DCU4                        DCU unit 4 instance register base
 ** \param [in] enTriggerSrc            The trigger source.
 ** \arg This parameter can be any value of @ref en_event_src_t
 **
 ** \retval Ok                          Write successfully.
 ** \retval ErrorInvalidParameter       DCUx is invalid
 **
 ******************************************************************************/
en_result_t DCU_SetTriggerSrc(M4_DCU_TypeDef *DCUx,
                              en_event_src_t enTriggerSrc)
{
    en_result_t enRet = ErrorInvalidParameter;
    __IO uint32_t *TRGSELx = DCU_TRGSELx(DCUx);

    if (NULL != TRGSELx)
    {
        /* Check the parameters */
        DDL_ASSERT(IS_VALID_TRG_SRC_EVENT(enTriggerSrc));

        *TRGSELx = (uint32_t)enTriggerSrc;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get DCU trigger source register address
 **
 ** \param [in] DCUx                    Pointer to DCU instance register base
 ** \arg M4_DCU1                        DCU unit 1 instance register base
 ** \arg M4_DCU2                        DCU unit 2 instance register base
 ** \arg M4_DCU3                        DCU unit 3 instance register base
 ** \arg M4_DCU4                        DCU unit 4 instance register base
 **
 ** \retval DCUx_TRGSEL address         DCUx is valid
 ** \retval NULL                        DCUx is invalid
 **
 ******************************************************************************/
static __IO uint32_t *DCU_TRGSELx(const M4_DCU_TypeDef *DCUx)
{
    __IO uint32_t *TRGSELx = NULL;

    if (M4_DCU1 == DCUx)
    {
        TRGSELx = &M4_AOS->DCU1_TRGSEL;
    }
    else if (M4_DCU2 == DCUx)
    {
        TRGSELx = &M4_AOS->DCU2_TRGSEL;
    }
    else if (M4_DCU3 == DCUx)
    {
        TRGSELx = &M4_AOS->DCU3_TRGSEL;
    }
    else if (M4_DCU4 == DCUx)
    {
        TRGSELx = &M4_AOS->DCU4_TRGSEL;
    }
    else
    {
        TRGSELx = NULL;
    }

    return TRGSELx;
}

//@} // DcuGroup

#endif /* DDL_DCU_ENABLE */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
